# print("x y z w")
# for x in range(2):
#     for y in range(2):
#         for z in range(2):
#             for w in range(2):
#                     F = (w <= (not(z<=x)) or y)
#                     if F == 0: #В случае когда у нас F принимает либо 0 либо 1 то смотрим таблицу 0 и 1 и сверяем строчки отталкиваясь на значение функции тоесть если в таблице две 1 по F и 1 по F тогда следует в столбце со значениями 0 отследить строку схожую (например с 3 нулями обычно она там единственная)
#                         print(x, y, z, w)
# print("zxyw") #Otvet
