#Алгоритм вычисления функций 𝐹(𝑛) и 𝐺(𝑛), где 𝑛 - целое число, задан следующими соотношениями:
# 𝐹(𝑛) = 𝐹(𝑛 − 4) + 3580, если >=19;
# 𝐹(𝑛) = 6 × (𝐺(𝑛 − 7) − 36), если 𝑛 < 19;
# 𝐺(𝑛) = 𝑛/20 + 28, если >= 248045
# 𝐺(𝑛) = 𝐺(𝑛 + 9) − 4, если 𝑛 < 248045.
# Чему равно значение функции 𝐹(673)?
from functools import lru_cache
def F(n):
    if n >= 19: return F(n-4) + 3580
    if n < 19: return 6 * (G(n-7)-36)
@lru_cache(100)
def G(n):
    if n >= 248045: return n / 20 + 28
    if n < 248045: return G(n + 9) - 4
for n in range(250000, 1, -1): G(n)
print(F(673))